In [1]:
import pandas as pd
import numpy as np
import FinanceDataReader  as fdr

In [2]:
# https://financedata.github.io/posts/finance-data-reader-users-guide.html

### 종목데이터 읽어오기

In [3]:
df = fdr.DataReader("114470")  # 국고채3년

In [4]:
df.tail()

              Open    High     Low   Close  Volume    Change
Date
2019-03-18  111020  111030  110975  110980   29938 -0.000360
2019-03-19  110975  110980  110940  110980   32879  0.000000
2019-03-20  110980  110985  110970  110980   29379  0.000000
2019-03-21  110970  111085  110970  111080   39028  0.000901
2019-03-22  111060  111070  111020  111060   31674 -0.000180

In [5]:
df.head()

             Open   High    Low  Close  Volume    Change
Date
2010-01-04  80691  80691  80551  80588  785403 -0.001981
2010-01-05  80627  80742  80627  80764    6443  0.002184
2010-01-06  80821  80872  80731  80751   10300 -0.000161
2010-01-07  80765  80948  80751  80965   13231  0.002650
2010-01-08  80992  81050  80892  80937    7663 -0.000346

### csv 파일로 저장하기

In [6]:
df.to_csv("..\\Data\\KOSEF국고채3년_data.csv",sep=",",encoding="utf-8")

### 마지막 영업일로 월별데이타 만들기

In [7]:
bm = df.resample("BM").last()

In [8]:
bm.tail()

              Open    High     Low   Close  Volume    Change
Date
2018-11-30  110167  110172  110167  110167     114  0.000045
2018-12-31  110536  110551  110521  110551     554  0.000000
2019-01-31  110750  110800  110740  110775   26279  0.000668
2019-02-28  110875  110894  110855  110895      71 -0.000090
2019-03-29  111060  111070  111020  111060   31674 -0.000180

In [9]:
#bm.to_csv("..\\Data\\KODEX국고채3년_Monthly_2010data.csv", sep=",",encoding="utf-8")